Delete and Insert Functions

Insert
----------------

In [4]:
import pandas as pd

var=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [5]:
# Insert new column
#  syntax:- var.insert(atWhatYouWantToInsert,NameOfColumn,Values)
var.insert(1,"C",var["A"])
var

   A  C  B
0  1  1  9
1  2  2  8
2  3  3  7
3  4  4  6
4  5  5  5

In [25]:
# Another way
var.insert(3,"Abhishek",[100,200,300,400,500])
print(var)

   A  C  B  Abhishek  Hundres  Hundreds
0  1  1  9       100      100       100
1  2  2  8       200      200       200
2  3  3  7       300      300       300
3  4  4  6       400      400       400
4  5  5  5       500      500       500

In [26]:
# Select particular amount of data
var["new"]=var["A"][:3]
var

   A  C  B  Abhishek  Hundres  Hundreds  new
0  1  1  9       100      100       100  1.0
1  2  2  8       200      200       200  2.0
2  3  3  7       300      300       300  3.0
3  4  4  6       400      400       400  NaN
4  5  5  5       500      500       500  NaN

Delete
----------

In [33]:
var1=var.pop("Hundreds")
var1

0    100
1    200
2    300
3    400
4    500
Name: Hundreds, dtype: int64

In [34]:
var

   A  C  B  Abhishek  new
0  1  1  9       100  1.0
1  2  2  8       200  2.0
2  3  3  7       300  3.0
3  4  4  6       400  NaN
4  5  5  5       500  NaN

In [35]:
# Another way to delete Column

del var["A"]
var

   C  B  Abhishek  new
0  1  9       100  1.0
1  2  8       200  2.0
2  3  7       300  3.0
3  4  6       400  NaN
4  5  5       500  NaN